# Целый числа, числа с плавающей точкой и строки

x = int(input("Введите значение переменной \"x\": "))
y = float(input("Введите дробное значение переменной \"y\": "))
g = x + y
print("Результат: " + str(g))
print("Округленный результат: " + str(round(g)))
print(f"Результат: {float(g)}")

# # Запрос данных от пользователя
# name = input("Введите ваше имя: ")
# age_str = input("Введите ваш возраст: ")
# height_str = input("Введите ваш рост в метрах: ")
#
# # Преобразование строковых данных в соответствующие типы
# age = int(age_str)
# height = float(height_str)
#
# # Вывод данных на экран
# print("Имя:", name)
# print("Возраст:", age)
# print("Рост:", height)